# Zone Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Space..::..Zone Property
Space Class See Also
---
Reports this space belong to which Zone.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Zone Zone { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Zone As Zone
	Get
```

Visual C++
---
```text
public:
property Zone^ Zone {
	Zone^ get ();
}
```

# Remarks
This property is used to retrieve the host zone of this space.
# See Also
Space Class
Autodesk.Revit.DB.Mechanical Namespace